import React from "react";
import s from "./Privacypolicy.module.scss";

export default function Privacypolicy() {
  return (
    <div className={s.main}>
      <h1> ДОГОВОР‑ОФЕРТА ОБ ОКАЗАНИИ УСЛУГ </h1>
      <p>
        сайта muzok.online
        <br />
        г. Москва «20» ноября 2025 г.
        <br />
        1. Общие положения
        <br />
        1.1. Настоящий договор‑оферта (далее — «Договор») является официальным
        предложением (офертой) самозанятого Витковского Платона Витальевича
        (далее — «Исполнитель») в адрес любого физического или юридического лица
        (далее — «Заказчик») и содержит все существенные условия предоставления
        услуги по созданию аудио‑визуальных поздравлений через сайт
        muzok.online.
        <br />
        1.2. Акцептом оферты (полным и безоговорочным принятием условий
        Договора) считается совершение Заказчиком любого из следующих действий:
        <br />
        выбор шаблона из каталога на сайте;
        <br />
        загрузка фотографий и ввод текстовой информации для создания
        поздравления;
        <br />
        оплата услуги.
        <br />
        1.3. Договор вступает в силу с момента акцепта и действует до полного
        исполнения сторонами своих обязательств.
        <br />
        2. Определения и термины
        <br />
        2.1. Сайт — интернет‑ресурс muzok.online, включающий веб‑страницы,
        контент, функционал и базы данных.
        <br />
        2.2. Услуга — создание аудио‑визуального поздравления с использованием
        фотографий Заказчика и стандартных шаблонов, опубликованных в каталоге
        на сайте.
        <br />
        2.3. Шаблон — готовый дизайн‑макет из каталога сайта, используемый для
        формирования аудио‑визуального поздравления.
        <br />
        2.4. Аудио‑визуальное поздравление — видеофайл, созданный на основе
        выбранного шаблона и персональных данных Заказчика (фотографий, текста,
        аудио).
        <br />
        3. Предмет договора
        <br />
        3.1. Исполнитель обязуется оказать Заказчику услугу по созданию
        аудио‑визуального поздравления посредством сайта muzok.online в
        соответствии с выбранным шаблоном и предоставленными данными, а Заказчик
        обязуется оплатить услугу и соблюдать условия Договора.
        <br />
        3.2. Каталог шаблонов, описание услуги, стоимость и условия оказания
        размещены на сайте muzok.online.
        <br />
        4. Права и обязанности сторон 4.1. Обязанности Исполнителя:
        <br />
        создать аудио‑визуальное поздравление в соответствии с выбранным
        шаблоном и данными, предоставленными Заказчиком;
        <br />
        обеспечить работоспособность сайта в пределах технически возможных
        параметров;
        <br />
        обработать персональные данные Заказчика в соответствии с политикой
        конфиденциальности;
        <br />
        предоставить Заказчику готовый видеофайл в формате MP4, отправив его в
        мессенджер WhatsApp или Telegram;
        <br />
        информировать Заказчика об изменениях в условиях оказания услуг не менее
        чем за 7 дней до вступления изменений в силу.
        <br />
        4.2. Обязанности Заказчика:
        <br />
        предоставить достоверные данные и качественные фотографии для создания
        поздравления;
        <br />
        своевременно оплатить услугу согласно выбранному тарифу;
        <br />
        не использовать результаты услуги в противоправных целях;
        <br />
        не предпринимать действий, способных нарушить работоспособность сайта
        или его компонентов.
        <br />
        4.3. Права Исполнителя:
        <br />
        отказать в оказании услуги при предоставлении Заказчиком контента,
        нарушающего законодательство РФ или нормы морали;
        <br />
        приостановить оказание услуги при выявлении технических сбоев или
        подозрительных действий со стороны Заказчика;
        <br />
        изменять перечень шаблонов и стоимость услуг с предварительным
        уведомлением.
        <br />
        4.4. Права Заказчика:
        <br />
        выбрать любой доступный шаблон из каталога на сайте;
        <br />
        предоставить собственные фотографии и текст для создания поздравления;
        <br />
        получить готовый видеофайл в оговоренном формате;
        <br />
        обратиться в службу поддержки по вопросам оказания услуги.
        <br />
        5. Порядок оказания и оплаты услуг
        <br />
        5.1. Услуга оказывается дистанционно посредством сайта muzok.online
        после оплаты.
        <br />
        5.2. Стоимость услуги указывается на сайте в рублях РФ. Цены могут быть
        изменены Исполнителем в одностороннем порядке с указанием их на сайте.
        <br />
        5.3. Оплата услуги производится посредством перевода через СБП по
        предоставленным реквизитам Исполнителя в момент оказания Услуги.
        Моментом оплаты считается поступление денежных средств на счёт
        Исполнителя.
        <br />
        5.4. Готовое аудио‑визуальное поздравление предоставляется Заказчику в
        виде видеофайла формата MP4, отправленного в мессенджер WhatsApp или
        Telegram.
        <br />
        5.5. Срок хранения готового видеофайла на серверах Исполнителя — 24 часа
        с момента создания. По истечении этого срока файл автоматически
        удаляется без дополнительного уведомления.
        <br />
        6. Порядок отказа от услуг и возврат средств
        <br />
        6.1. Заказчик вправе отказаться от услуги до момента её фактического
        оказания (создания аудио‑визуального поздравления).
        <br />
        6.2. Возврат средств осуществляется в следующих случаях:
        <br />
        техническая невозможность оказания услуги по вине Исполнителя;
        <br />
        ошибочная двойная оплата одной и той же услуги;
        <br />
        невыполнение Исполнителем обязательств по созданию поздравления в
        установленный срок.
        <br />
        6.3. Возврат производится на тот же платёжный инструмент, с которого
        была произведена оплата, в течение 10 рабочих дней с момента подачи
        заявления.
        <br />
        6.4. После создания аудио‑визуального поздравления и предоставления
        готового файла Заказчику одним из способов, указанных в п. 5.4, возврат
        средств не производится, если иное не предусмотрено действующим
        законодательством РФ.
        <br />
        7. Ответственность сторон
        <br />
        7.1. Стороны несут ответственность за неисполнение или ненадлежащее
        исполнение своих обязательств в соответствии с действующим
        законодательством РФ и условиями Договора.
        <br />
        7.2. Исполнитель не несёт ответственности за:
        <br />
        временные перебои в работе сайта, вызванные техническими причинами;
        <br />
        действия третьих лиц, направленные на нарушение работы сайта;
        <br />
        качество и содержание фотографий, предоставленных Заказчиком;
        <br />
        некорректную работу сторонних сервисов, интегрированных на сайте.
        <br />
        7.3. Заказчик несёт ответственность за соответствие предоставленного
        контента (фотографий, текста) требованиям законодательства РФ и нормам
        морали.
        <br />
        8. Персональные данные и конфиденциальность
        <br /> 8.1. Обработка персональных данных Заказчика осуществляется в
        соответствии с Политикой конфиденциальности, размещённой на сайте
        muzok.online.
        <br />
        8.2. Заказчик даёт согласие на обработку своих персональных данных
        (включая фотографии) исключительно для целей исполнения Договора и
        создания аудио‑визуального поздравления.
        <br />
        8.3. Исполнитель гарантирует, что предоставленные Заказчиком фотографии
        будут использованы только для создания заказанного поздравления и не
        будут переданы третьим лицам без согласия Заказчика, а также будут
        удалены с сервера Исполнителя в течение 24 часов с момента оказания
        услуги.
        <br />
        9. Форс‑мажор
        <br />
        9.1. Стороны освобождаются от ответственности за частичное или полное
        неисполнение обязательств, если это вызвано обстоятельствами
        непреодолимой силы (стихийные бедствия, военные действия, действия
        госорганов и т. п.).
        <br />
        9.2. Сторона, для которой создалась невозможность исполнения
        обязательств, обязана уведомить другую сторону в течение 3 рабочих дней
        с момента наступления таких обстоятельств.
        <br />
        10. Срок действия и порядок изменения договора
        <br />
        10.1. Договор действует с момента акцепта до полного исполнения
        обязательств сторонами.
        <br />
        10.2. Исполнитель вправе вносить изменения в условия Договора. Изменения
        вступают в силу после их публикации на сайте muzok.online.
        <br />
        10.3. Продолжение использования сайта после внесения изменений считается
        акцептом новой редакции Договора.
        <br />
        11. Разрешение споров <br /> 11.1. Все споры и разногласия разрешаются
        путём переговоров между сторонами.
        <br />
        11.2. При невозможности урегулирования спора путём переговоров он
        подлежит рассмотрению в суде по месту нахождения Исполнителя в
        соответствии с действующим законодательством РФ.
        <br />
        12. Заключительные положения 12.1. Адрес сайта: muzok.online. 12.2.
        Электронная почта для обращений: support@muzok.online.
        <br />
        12.3. Реквизиты Исполнителя:
        <br />
        ФИО: Витковский Платон Витальевич
        <br />
        Статус: самозанятый
        <br />
        ИНН: 771865183780
        <br />
        Адрес: 129075, г. Москва, ул. Алтайская, д. 19, кв. 104
        <br />
        Исполнитель: Витковский П. В.
        <br />
        Заказчик: Акцепт оферты подтверждает согласие с условиями Договора.
      </p>
    </div>
  );
}
